Can't paste duplicate types. Only non duplicate types will be pasted.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyDuplicates { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyDuplicates As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyDuplicates {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace